Fix: Redesigned the documentation page
